tap "facebook/fb"
tap "hashicorp/tap"
tap "xcodesorg/made"

# CLI tools
brew "argo"
brew "argocd"
brew "asdf"
brew "awscli"
brew "bat"
brew "cosign"
brew "direnv"
brew "eza"
brew "fnm"
brew "fzf"
brew "gh"
brew "ghq"
brew "git"
brew "git-delta"
brew "go"
brew "hashicorp/tap/terraform"
brew "htop"
brew "hugo"
brew "imagemagick"
brew "iperf3"
brew "jq"
brew "k9s"
brew "kind"
brew "krew"
brew "kubectl"
brew "kubectx"
brew "kustomize"
brew "lazygit"
brew "node@24"
brew "php@8.3"
brew "poppler"
brew "python@3.14"
brew "rbenv"
brew "ripgrep"
brew "ruby@3.4"
brew "rustup"
brew "shellcheck"
brew "sops"
brew "speedtest-cli"
brew "sshpass"
brew "starship"
brew "stern"
brew "tig"
brew "trivy"
brew "uv"
brew "vim"
brew "wget"
brew "yq"
brew "yt-dlp"
brew "zoxide"

# Casks
cask "codex"
cask "discord"
cask "font-jetbrains-mono"
cask "gcloud-cli"
cask "ghostty"
cask "google-chrome"
cask "headlamp"
cask "slack"
cask "tailscale-app"
cask "visual-studio-code"
cask "xcodes-app"
