tap "homebrew/bundle"
tap "facebook/fb"

# CLI tools
brew "argo"
brew "argocd"
brew "awscli"
brew "bat"
brew "fnm"
brew "direnv"
brew "fzf"
brew "gh"
brew "ghq"
brew "git-delta"
brew "go"
brew "htop"
brew "idb-companion"
brew "jq"
brew "k9s"
brew "kind"
brew "krew"
brew "kubectl"
brew "kubectx"
brew "kustomize"
brew "rbenv"
brew "ripgrep"
brew "rustup"
brew "shellcheck"
brew "sops"
brew "starship"
brew "stern"
brew "tailscale"
brew "terraform"
brew "tig"
brew "tree"
brew "uv"
brew "xcodes"
brew "yq"

# Casks
cask "discord"
cask "ghostty"
cask "google-chrome"
cask "gcloud-cli"
cask "visual-studio-code"
